mexmiart04t6actgr.org
#+title: Actividad grupal: Resolución de un problema mediante búsqueda heurística
#+subject: Razonamiento y planificación automática
#+keywords: AI, planificación, A*, heurística
#+author: Edgar Uriel Domínguez Espinoza
#+options: toc:nil ^:{} title:nil tex:dvipng num:nil
#+language: es
#+latex_class: article
#+latex_class_options: [a4paper,12pt]
#+latex_header: \usepackage[spanish, mexico]{babel}
#+latex_header: \usepackage[left=2cm,right=2cm,top=2.5cm,bottom=2.5cm]{geometry}
#+latex_header: \usepackage{listings}
#+latex_header: \usepackage{multirow}
#+latex_header: \usepackage[table]{xcolor}
#+latex_header: \usepackage{fancyhdr}
#+latex_header: \usepackage[color={[gray]{0.5}},angle=90,fontsize=9pt,anchor=lb,pos={0.03\paperwidth,0.95\paperheight}]{draftwatermark}
#+latex_header: \usepackage{titlesec}
#+latex_header: \usepackage{gb4e}
#+latex_header: \usepackage{algorithm}
#+latex_header: \usepackage{algpseudocode}
#+latex_header_extra: \noautomath
#+latex_header_extra: \linespread{1.3}
#+latex_header_extra: \usepackage[sfdefault,lf]{carlito}
#+latex_header_extra: \makeatletter
#+latex_header_extra: \let\newtitle\@title
#+latex_header_extra: \makeatother
#+latex_header_extra: \definecolor{UnirLight}{HTML}{E6F4F9}
#+latex_header_extra: \definecolor{UnirDark}{HTML}{0098CD}
#+latex_header_extra: \arrayrulecolor{UnirDark}
#+latex_header_extra: \pagestyle{fancy}
#+latex_header_extra: \renewcommand{\headrulewidth}{0pt}
#+latex_header_extra: \headheight=45pt
#+latex_header_extra: \setlength{\footskip}{64pt}
#+latex_header_extra: \lhead{}
#+latex_header_extra: \chead{
#+latex_header_extra: \begin{tabular}{|c|l|c|}
#+latex_header_extra: \hline
#+latex_header_extra: \rowcolor{UnirLight}
#+latex_header_extra: \textcolor{UnirDark}{Asignatura} & \textcolor{UnirDark}{Datos del alumno} & \textcolor{UnirDark}{Fecha} \\
#+latex_header_extra: \hline
#+latex_header_extra: \textbf{Razonamiento y planificación} & Bernal Castillo Aldo Alberto & \\
#+latex_header_extra: \textbf{automática} & Calderón Zetter María Inés & 11 de abril de 2022 \\
#+latex_header_extra: & Domínguez Espinoza Edgar Uriel & \\
#+latex_header_extra: \hline
#+latex_header_extra: \end{tabular}}
#+latex_header_extra: \rhead{}
#+latex_header_extra: \lfoot{}
#+latex_header_extra: \cfoot{}
#+latex_header_extra: \rfoot{\makebox(70,56)[t]{\textcolor{UnirDark}{Actividades}}\colorbox{UnirDark}{\makebox(10,56)[t]{\textcolor{white}{\thepage}}}}
#+latex_header_extra: \SetWatermarkText{{\copyright} Universidad Internacional de La Rioja en México (UNIR)}
#+latex_header_extra: \titleformat*{\section}{\color{UnirDark}\normalsize\bfseries}
#+latex_header_extra: \titleformat*{\subsection}{\color{UnirDark}\normalsize\bfseries}
#+latex_header_extra: \definecolor{gray97}{gray}{.97}
#+latex_header_extra: \definecolor{gray75}{gray}{.75}
#+latex_header_extra: \definecolor{gray45}{gray}{.45}
#+latex_header_extra: \lstset{ frame=Ltb,
#+latex_header_extra:      framerule=0pt,
#+latex_header_extra:      aboveskip=0.5cm,
#+latex_header_extra:      framextopmargin=3pt,
#+latex_header_extra:      framexbottommargin=3pt,
#+latex_header_extra:      framexleftmargin=0.4cm,
#+latex_header_extra:      xleftmargin=6mm,
#+latex_header_extra:      framesep=0pt,
#+latex_header_extra:      rulesep=.4pt,
#+latex_header_extra:      columns=fixed,
#+latex_header_extra:      backgroundcolor=\color{gray97},
#+latex_header_extra:      rulesepcolor=\color{black},
#+latex_header_extra:      stringstyle=\ttfamily,
#+latex_header_extra:      showstringspaces = false,
#+latex_header_extra:      basicstyle=\small\ttfamily,
#+latex_header_extra:      commentstyle=\color{gray45},
#+latex_header_extra:      keywordstyle=\bfseries,
#+latex_header_extra:      numbers=left,
#+latex_header_extra:      numbersep=15pt,
#+latex_header_extra:      numberstyle=\tiny,
#+latex_header_extra:      numberfirstline = false,
#+latex_header_extra:      breaklines=true,}
#+latex_header_extra: \lstnewenvironment{listing}[1][]
#+latex_header_extra:    {\lstset{#1}\pagebreak[0]}{\pagebreak[0]}
#+latex_header_extra: \lstdefinestyle{consola}
#+latex_header_extra:    {basicstyle=\scriptsize\bf\ttfamily,
#+latex_header_extra:     backgroundcolor=\color{gray75},}
#+latex_header_extra: \lstdefinestyle{Lisp}
#+latex_header_extra:    {language=Lisp,}

#+ODT_STYLES_FILE: "~/Templates/libreoffice/unir.ott"

#+bibliography: mexmiart04t6actgr.bib
#+cite_export: csl /home/genomorro/Templates/csl-styles/apa.csl

\textcolor{UnirDark}{\LARGE\bfseries\newtitle}

** Introducción

Una observación común sobre los problemas de búsqueda en un grafo es que coinciden con la localización de la ruta más corta. Los algoritmos que buscan en grafos representan al mismo como una matriz o una estructura (arbórea) implícita de nodos generada de forma iterativa y expandida según el algoritmo implementado.

Los problemas más prominentes sobre la ruta más corta son: /Single-source shortest path/ en el cual se busca un camino que minimiza la suma de los pesos de los bordes constituyentes; y /All pairs shortest paths/ que busca caminos para cada dos vértices. Los algoritmos más importantes para estos problemas son: 1) Bellman-Ford, que soluciona Single-source shortest path incluso hay costes negativos; 2) Floyd-Warshall, soluciona All pairs shortest paths; 3) Dijkstra, soluciona Single-source shortest path siempre que los costes sean mayores a cero; y 4) A^{*}, soluciona Single-source shortest path con costes no negativos. [cite:@EdelkampSchroedl2011 p. 47]

Particularmente, A^{*} realiza una búsqueda heurística, característica de la cual carecen otros algoritmos. La heurística se usa para estimar la distancia restante aún sin haber explorado una ruta hasta el objetivo. En este sentido es posible diferenciar entre dos tipos de algoritmos: aquellos informados, como el A^{*} y aquellos no informados como los otros listados en el párrafo anterior. [cite:@EdelkampSchroedl2011 p. 47]

En este documento se muestra una implementación del algoritmo A^{*} para solucionar el problema de un robot que puede moverse en un mapa cuadricular en cuatro direcciones, dos verticales y dos horizontales y debe mover tres cargamentos a lugares específicos.

** Sobre el algoritmo A^{*}

El algoritmo A^{*} es considerado comúnmente como una mejora de Dijkstra [cite:@Domkin2021 cap. 7]. La estimación heurística más común del algoritmo es la mostrada en la ecuación [[eq:1]].

<<eq:1>>
\begin{equation}
f(u) = g(u) + h(u)
\end{equation}

Dentro de [[eq:1]] la función $g(u)$  calcula el coste del actual camino, mientras que $h(u)$ es la estimación heurística del coste restante hasta el objetivo, por lo tanto $f(u)$ es la aproximación total del coste de la ruta. [cite:@EdelkampSchroedl2011 p. 69]

Existen variantes sobre A^{*}, constantemente se busca la optimización del algoritmo para un mejor desempeño computacional. La implementación más básica se muestra en el algoritmo \ref{alg:a-star} [cite:@EdelkampSchroedl2011 p. 70].

\begin{algorithm}
\begin{algorithmic}
\caption{Algoritmo A*}\label{alg:a-star}
\State $Cerrado \gets \emptyset$ \Comment{Inicialización}
\State $Abierto \gets {s}$ \Comment{Inserta s en la búsqueda}
\State $f(s) \gets h(s)$ \Comment{Inicializa estimado}
\While{$Abierto \neq \emptyset$} \Comment{Mientras haya nodos donde buscar}

\State Elimina $u$ con $f(u)$ mínimo de $Abierto$ \Comment{Selección de nodo a expandir} 
\State Inserta $u$ en $Cerrado$ \Comment{Actualiza lista de nodos expandidos}
\If{$Meta(u)$} \Comment{Si llego a la meta}

    \Return $Camino(u)$ \Comment{Muestra la solución}
\ElsIf{$Sucesor(u) \gets \Expansión(u)$} \Comment{La expansión produce un conjunto sucesor}
    \For{$v \ni Sucesor(u)$} \Comment{Para todo sucesor $v$ de $u$}
        \State $Mejor(u,v) \Comment{Llamada de subrutina}
\EndFor
\EndIf
\EndWhile

\Return $\emptyset$ \Comment{Sin solución}
\end{algorithmic}
\end{algorithm}

