mexmiart04t6actgr.tex
% Created 2022-04-11 lun 13:39
% Intended LaTeX compiler: pdflatex
\documentclass[a4paper,12pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[spanish, mexico]{babel}
\usepackage[left=2cm,right=2cm,top=2.5cm,bottom=2.5cm]{geometry}
\usepackage{listings}
\usepackage{multirow}
\usepackage[table]{xcolor}
\usepackage{fancyhdr}
\usepackage[color={[gray]{0.5}},angle=90,fontsize=9pt,anchor=lb,pos={0.03\paperwidth,0.95\paperheight}]{draftwatermark}
\usepackage{titlesec}
\usepackage{gb4e}
\usepackage{algorithm}
\usepackage{algpseudocode}
\noautomath
\linespread{1.3}
\usepackage[sfdefault,lf]{carlito}
\title{Actividad grupal: Resolución de un problema mediante búsqueda heurística}
\makeatletter
\let\newtitle\@title
\makeatother
\definecolor{UnirLight}{HTML}{E6F4F9}
\definecolor{UnirDark}{HTML}{0098CD}
\arrayrulecolor{UnirDark}
\pagestyle{fancy}
\renewcommand{\headrulewidth}{0pt}
\headheight=45pt
\setlength{\footskip}{64pt}
\lhead{}
\chead{
\begin{tabular}{|c|l|c|}
\hline
\rowcolor{UnirLight}
\textcolor{UnirDark}{Asignatura} & \textcolor{UnirDark}{Datos del alumno} & \textcolor{UnirDark}{Fecha} \\
\hline
\textbf{Razonamiento y planificación} & Bernal Castillo Aldo Alberto & \\
\textbf{automática} & Calderón Zetter María Inés & 11 de abril de 2022 \\
& Domínguez Espinoza Edgar Uriel & \\
\hline
\end{tabular}}
\rhead{}
\lfoot{}
\cfoot{}
\rfoot{\makebox(70,56)[t]{\textcolor{UnirDark}{Actividades}}\colorbox{UnirDark}{\makebox(10,56)[t]{\textcolor{white}{\thepage}}}}
\SetWatermarkText{{\copyright} Universidad Internacional de La Rioja en México (UNIR)}
\titleformat*{\section}{\color{UnirDark}\normalsize\bfseries}
\titleformat*{\subsection}{\color{UnirDark}\normalsize\bfseries}
\definecolor{gray97}{gray}{.97}
\definecolor{gray75}{gray}{.75}
\definecolor{gray45}{gray}{.45}
\lstset{ frame=Ltb,
framerule=0pt,
aboveskip=0.5cm,
framextopmargin=3pt,
framexbottommargin=3pt,
framexleftmargin=0.4cm,
xleftmargin=6mm,
framesep=0pt,
rulesep=.4pt,
columns=fixed,
backgroundcolor=\color{gray97},
rulesepcolor=\color{black},
stringstyle=\ttfamily,
showstringspaces = false,
basicstyle=\small\ttfamily,
commentstyle=\color{gray45},
keywordstyle=\bfseries,
numbers=left,
numbersep=15pt,
numberstyle=\tiny,
numberfirstline = false,
breaklines=true,}
\lstnewenvironment{listing}[1][]
{\lstset{#1}\pagebreak[0]}{\pagebreak[0]}
\lstdefinestyle{consola}
{basicstyle=\scriptsize\bf\ttfamily,
backgroundcolor=\color{gray75},}
\lstdefinestyle{Lisp}
{language=Lisp,}
\author{Edgar Uriel Domínguez Espinoza}
\hypersetup{
 pdfauthor={Edgar Uriel Domínguez Espinoza},
 pdftitle={Actividad grupal: Resolución de un problema mediante búsqueda heurística},
 pdfkeywords={AI, planificación, A*, heurística},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.5.2)}, 
 pdflang={Spanish}}
\makeatletter
\newcommand{\citeprocitem}[2]{\hyper@linkstart{cite}{citeproc_bib_item_#1}#2\hyper@linkend}
\makeatother

\usepackage[notquote]{hanging}
\begin{document}

\textcolor{UnirDark}{\LARGE\bfseries\newtitle}

\section*{Introducción}
\label{sec:org1381100}

Una observación común sobre los problemas de búsqueda en un grafo es que coinciden con la localización de la ruta más corta. Los algoritmos que buscan en grafos representan al mismo como una matriz o una estructura (arbórea) implícita de nodos generada de forma iterativa y expandida según el algoritmo implementado.

Los problemas más prominentes sobre la ruta más corta son: \emph{Single-source shortest path} en el cual se busca un camino que minimiza la suma de los pesos de los bordes constituyentes; y \emph{All pairs shortest paths} que busca caminos para cada dos vértices. Los algoritmos más importantes para estos problemas son: 1) Bellman-Ford, que soluciona Single-source shortest path incluso hay costes negativos; 2) Floyd-Warshall, soluciona All pairs shortest paths; 3) Dijkstra, soluciona Single-source shortest path siempre que los costes sean mayores a cero; y 4) A\textsuperscript{*}, soluciona Single-source shortest path con costes no negativos. (\citeprocitem{3}{Edelkamp \& Schroedl, 2011, p. 47})

Particularmente, A\textsuperscript{*} realiza una búsqueda heurística, característica de la cual carecen otros algoritmos. La heurística se usa para estimar la distancia restante aún sin haber explorado una ruta hasta el objetivo. En este sentido es posible diferenciar entre dos tipos de algoritmos: aquellos informados, como el A\textsuperscript{*} y aquellos no informados como los otros listados en el párrafo anterior. (\citeprocitem{3}{Edelkamp \& Schroedl, 2011, p. 47})

En este documento se muestra una implementación del algoritmo A\textsuperscript{*} para solucionar el problema de un robot que puede moverse en un mapa cuadricular en cuatro direcciones, dos verticales y dos horizontales y debe mover tres cargamentos a lugares específicos.

\section*{Sobre el algoritmo A\textsuperscript{*}}
\label{sec:org1e9cad1}

El algoritmo A\textsuperscript{*} es considerado comúnmente como una mejora de Dijkstra (cap. \citeprocitem{2}{Domkin, 2021, p. 7}). La estimación heurística más común del algoritmo es la mostrada en la ecuación \ref{orgb061ee5}.

\label{orgb061ee5}
\begin{equation}
f(u) = g(u) + h(u)
\end{equation}

Dentro de \ref{orgb061ee5} la función \(g(u)\)  calcula el coste del actual camino, mientras que \(h(u)\) es la estimación heurística del coste restante hasta el objetivo, por lo tanto \(f(u)\) es la aproximación total del coste de la ruta. (\citeprocitem{3}{Edelkamp \& Schroedl, 2011, p. 69})

Existen variantes sobre A\textsuperscript{*}, constantemente se busca la optimización del algoritmo para un mejor desempeño computacional. La implementación más básica se muestra en el algoritmo \ref{alg:a-star} (\citeprocitem{3}{Edelkamp \& Schroedl, 2011, p. 70}).

\begin{algorithm}
\begin{algorithmic}
\caption{Algoritmo A*}\label{alg:a-star}
\State $Cerrado \gets \emptyset$ \Comment{Inicialización}
\State $Abierto \gets {s}$ \Comment{Inserta s en la búsqueda}
\State $f(s) \gets h(s)$ \Comment{Inicializa estimado}
\While{$Abierto \neq \emptyset$} \Comment{Mientras haya nodos donde buscar}

\State Elimina $u$ con $f(u)$ mínimo de $Abierto$ \Comment{Selección de nodo a expandir} 
\State Inserta $u$ en $Cerrado$ \Comment{Actualiza lista de nodos expandidos}
\If{$Meta(u)$} \Comment{Si llego a la meta}

    \Return $Camino(u)$ \Comment{Muestra la solución}
\ElsIf{$Sucesor(u) \gets \Expansión(u)$} \Comment{La expansión produce un conjunto sucesor}
    \For{$v \ni Sucesor(u)$} \Comment{Para todo sucesor $v$ de $u$}
        \State $Mejor(u,v) \Comment{Llamada de subrutina}
\EndFor
\EndIf
\EndWhile

\Return $\emptyset$ \Comment{Sin solución}
\end{algorithmic}
\end{algorithm}
