mexmiart04t6actgr.tex

\section*{Implementación}
\label{sec:orgcb84182}

Para implementar el algoritmo A\textsuperscript{*} se usará la familia de lenguajes Lisp (\citeprocitem{1}{Code, 2022}), por lo que se solicitarán los siguientes requisitos:

\begin{itemize}
\item Un intérprete de Lisp compatible con Quicklisp, por ejemplo: SBCL o CLisp.
\item Quicklisp.
\item Un editor de texto que facilite la interacción con el REPL de Lisp, por ejemplo: GNU Emacs.
\end{itemize}

En este documento se harán anotaciones mínimas debido a que Lisp es un lenguaje autodocumentado y al leer el código fuente, adjunto a este documento, se podrá leer de forma directa la documentación del mismo.

El código inicia con la preparación del entorno: se instalan las dependencias necesarias y se crea un paquete para el correcto procesamiento del programa.

\lstset{language=Lisp,label= ,caption= ,captionpos=b,numbers=none,numbers=left}
\begin{lstlisting}
(eval-when (:load-toplevel :compile-toplevel :execute)
  (ql:quickload '("pileup" "iterate")))
(defpackage :a*-search (:use :common-lisp :pileup :iterate))
(in-package :a*-search)
\end{lstlisting}

Continúa el código con la definición de variables a utilizar. Se puede señalar que cada una de las variables son modificables y permitirían adaptar el programa a cualquier problema similar, es decir, que tenga los mismos elementos a considerar.

\lstset{language=Lisp,label= ,caption= ,captionpos=b,numbers=none,numbers=left}
\begin{lstlisting}
(defvar *size* 4 "Esta será el tamaño del área, el valor es el lado de un cuadrado.")
(defvar *barriers* '((0 . 1) (1 . 1)) "Esta variable es una lista de cons (X . Y). La posición 0 es la esquina inferior izquierda.")
(defvar *barrier-cost* 100 "No es posible evitar que  se inspeccione una pared, pero se eleva el coste, así se impide su elección.")
(defvar *directions* '((0 . -1) (0 . 1) (1 . 0) (-1 . 0)) "Agregar aquí los posibles movimientos posibles, de 1 a 8 elementos.")
(defvar *load* 0 "Si *LOAD* es 0 no hay carga sobre el robot")
\end{lstlisting}

Ahora se define la estructura del nodo, misma que al tener un conjunto de nodos formará un grafo. Note que el coste por nodo es cero, por tanto, solo los movimientos suman al modelo matemático.

\lstset{language=Lisp,label= ,caption= ,captionpos=b,numbers=none,numbers=left}
\begin{lstlisting}
(defstruct (node (:constructor node))
  "Estructura de datos para un nodo de un grafo."
  (pos (cons 0 0) :type cons)
  (path nil)
  (cost 0 :type fixnum)
  (f-value 0 :type fixnum))
\end{lstlisting}

Poder imprimir el grafo en forma de mapa ayudará a comprender mejor el resultado del programa, incluso si es un mapa sencillo creado solo por elementos de texto. Es importante destacar que para esta implementación, los nodos se numeran igual que en un plano cartesiano, es decir, el nodo \((0 . 0)\) está en la esquina inferior izquierda. Por lo tanto se considera que el mapa se imprimirá en espejo horizontal respecto al documento de requerimientos, esto es así porque se usaron expresiones S para representar coordenadas, no un sistema matricial común.

\lstset{language=Lisp,label= ,caption= ,captionpos=b,numbers=none,numbers=left}
\begin{lstlisting}
(defun print-path (path start end &optional (barriers *barriers*)
		   &aux (size (+ 2 *size*)))
  "Imprime el área de trabajo.  Identifica PATH por medio de un punto (.),  START con una r, END
con una m y las paredes con una X. Cualquier otro elemento quedará en blanco."
  (format t "~v@{~A~:*~}~%" size "-") ; Borde superior
  ; Área disponible, imprime línea a línea
  (iter (for y from (1- *size*) downto 0)
	(format t "|") ; Margen izquierdo
	; Columnas
	(iter (for x from 0 below *size*)
	      (format t "~A"
		      (cond ((member (cons y x) barriers :test #'equal) "X")
			    ((equal (cons y x) start) "r")
			    ((equal (cons y x) end) "m")
			    ((Member (cons y x) path :test #'equal) ".")
			    (t " "))))
	(format t "|~%")) ; Margen derecho
  (format t "~v@{~A~:*~}~%" size "-") ; Borde inferior
  (iter
    (for position in path)
    (format t "(~D,~D)" (car position) (cdr position))
    (finally (terpri))))
\end{lstlisting}

También es necesario crear una serie de funciones secundarias para realizar tareas comunes. Si se imprimiera el resultado de cada una de ellas se obtendría la información más detallada del proceso realizado por el algoritmo, sin embargo, se ha decidido para esta implementación solo imprimir la lista abierta, es decir, las posibilidades de movimiento desde un nodo actual hacia la meta.

\lstset{language=Lisp,label= ,caption= ,captionpos=b,numbers=none,numbers=left}
\begin{lstlisting}
(defun valid-position-p (position)
  "Regresa T si POSITION es un punto válido en el mapa."
  (let ((x (car position))
	(y (cdr position))
	(max (1- *size*)))
    (and (<= 0 x max)
	 (<= 0 y max))))
(defun move (position direction)
  "Regresa un nuevo punto cuando se mueve POSITION en una DIRECTION. Asume posiciones válidas."
  (let ((x (car position))
	(y (cdr position))
	(dx (car direction))
	(dy (cdr direction)))
    (format t "Posición posible: (~D . ~D)~%" (+ x dx) (+ y dy))
    (cons (+ x dx) (+ y dy))))
(defun next-positions (current-position)
  "Regresa una lista con los posibles posiciones siguientes."
  (remove-if-not #'valid-position-p
		 (mapcar (lambda (d) (move current-position d)) *directions*)))
\end{lstlisting}

Se procede a la implementación de la heurística con la distancia de Manhattan. Esta heurística puede ser reemplazada con otras similares, como la distancia euclidiana.

\lstset{language=Lisp,label= ,caption= ,captionpos=b,numbers=none,numbers=left}
\begin{lstlisting}
(defun distance (current-position goal)
  "Calcula la distancia Manhattan existente desde CURRENT-POSITION hasta GOAL."
  (+ (abs (- (car goal) (car current-position)))
     (abs (- (cdr goal) (cdr current-position)))))
\end{lstlisting}

Ahora es posible escribir el código del algoritmo principal. Es importante notar que esta función recibe como parte de sus argumentos otras dos funciones: la heurística y las posiciones siguientes. Al hacer esto, se facilita la modificación del programa para su adaptación a otros problemas.

\lstset{language=Lisp,label= ,caption= ,captionpos=b,numbers=none,numbers=left}
\begin{lstlisting}
(defun a* (start goal heuristics next &optional (information 0))
  "Calcula la ruta más corta de START a GOAL usando HEURISTICS. Genera la lista de caminos usando NEXT. Si INFORMATION es 1 se imprimirán detalles de cada iteración."
  (let ((visited (make-hash-table :test #'equalp))) ; Crea la lista cerrada. Nodos visitados
    (flet ((pick-next-node (queue)
	     ; Obtiene el primer elemento que forma la cola
	     (heap-pop queue))
	   (expand-node (node queue)
	     ; Expande los nodos de posible avance y los agrega a la cola si no han
	     ; sido visitados.
	     (iter
	       (with costs = (node-cost node))
	       (for position in (funcall next (node-pos node)))
	       (for cost = (1+ costs))
	       (for f-value = (+ cost (funcall heuristics position goal)
				 (if (member position *barriers* :test #'equal)
				     100
				     0)))
	       ; Revisa si el nodo ha sido visitado
	       (unless (gethash position visited)
	       ; Agrega el nodo a la cola
	       (heap-insert
		(node :pos position :path (cons position (node-path node))
		      :cost cost :f-value f-value)
		queue)))))
      ; La búsqueda algoritmica
      (iter
	;; Crea la cola
	(with queue = (make-heap #'<= :name "queue" :size 1000 :key #'node-f-value))
	(with initial-cost = (funcall heuristics start goal))
	(initially (heap-insert (node :pos start :path (list start) :cost 0
				      :f-value initial-cost)
				queue))
	(for counter from 1)
	(for current-node = (pick-next-node queue))
	(for current-position = (node-pos current-node))
	; Imprime información sobre la iteración
	(when (and (not (zerop information))
		   (zerop (mod counter information)))
	  (format t "Nodo ~D, tamaño de la lista abierta: ~D, coste actual: ~D~%"
		  counter (heap-count queue)
		  (node-cost current-node)))
	; Si la posición actual no es GOAL continua
	(until (equalp current-position goal))
	; Agrega el nodo actual a la lista de visitados
	(setf (gethash current-node visited) t)
	; Expande el nodo actual
	(expand-node current-node queue)
	(finally (return (values (nreverse (node-path current-node))
				 (node-cost current-node)
				 counter)))))))
\end{lstlisting}

Hasta este punto ya sería posible utilizar el código escrito para resolver problemas Single-source shortest path. Mas allá de lo anterior, el problema que se desea resolver requiere que un robot viaje de un punto inicial a recoger una carga para después llevarla a otro punto dentro del mapa, es decir, cada trayecto del robot consiste en dos viajes y debe distinguir cuando lleva carga y cuando viaja solo, este comportamiento corresponde a esta última función.

\lstset{language=Lisp,label= ,caption= ,captionpos=b,numbers=none,numbers=left}
\begin{lstlisting}
(defun robot (start package goal &key (heuristics #'distance))
  "Define el movimiento de un robot el cual se ubica en START, se mueve y recoge un inventario en PACKAGE y lo lleva hasta GOAL."
  (multiple-value-bind (path cost steps)
      (a* start package heuristics #'next-positions 1)
    (format t "La ruta entre el punto inicial (r) al punto final (m) en ~D pasos con coste: ~D~%" steps cost)
    (print-path path start package))
  (setq *load* 1)
  (format t "Carga del robot: ~D~%" *load*)
  (multiple-value-bind (path cost steps)
      (a* package goal heuristics #'next-positions 1)
    (format t "La ruta entre el punto inicial (r) al punto final (m) en ~D pasos con coste: ~D~%" steps cost)
    (print-path path package goal))
  (setq *load* 0)
  (format t "Carga del robot: ~D~%" *load*))
\end{lstlisting}
