mexmiart04t6actgr.org
** Resultado

Se dividió el problema general en tres problemas menores:

- Problema 1 :: El robot inicia en $(2 . 2)$, recoge un inventario en $(0 . 0)$ y lo lleva a $(3 .3)$.
- Problema 2 :: El robot inicia en $(2 . 2)$, recoge un inventario en $(2 . 0)$ y lo lleva a $(3 .2)$.
- Problema 3 :: El robot inicia en $(2 . 2)$, recoge un inventario en $(0 . 3)$ y lo lleva a $(3 .1)$.

Los códigos para ejecutar estas trayectorias se muestran a continuación.

#+attr_latex: :options numbers=left
#+begin_src lisp
  (robot '(2 . 2) '(0 . 0) '(3 . 3))
  (robot '(2 . 2) '(2 . 0) '(3 . 2))
  (robot '(2 . 2) '(0 . 3) '(3 . 1))
#+end_src

El resultado es amplio y descriptivo, incluye el número de nodos que se han examinado, el número de nodos en la lista, el coste actual y los posibles movimientos que pueden seguir. Posteriormente, junto con el mapa que marca la ruta total, se mostrará el número de pasos realizados y el coste total de la operación. Finalmente, se muestran los nodos que componen la ruta y si el resultado de la operación de carga que lleva a cabo el robot[fn:1]. Un ejemplo de esta información se muestra enseguida con el resultado del Problema 2.

#+attr_latex: :options style=consola
#+begin_src sh
A*-SEARCH[18]> Nodo 1, tamaño de la lista abierta: 0, coste actual: 0
Posición posible: (2 . 1)
Posición posible: (2 . 3)
Posición posible: (3 . 2)
Posición posible: (1 . 2)
Nodo 2, tamaño de la lista abierta: 3, coste actual: 1
Posición posible: (2 . 0)
Posición posible: (2 . 2)
Posición posible: (3 . 1)
Posición posible: (1 . 1)
Nodo 3, tamaño de la lista abierta: 6, coste actual: 2
La ruta entre el punto inicial (r) al punto final (m) en 3 pasos con coste: 2
------
|    |
|m.r |
| X  |
| X  |
------
(2,2)(2,1)(2,0)
Carga del robot: 1
Nodo 1, tamaño de la lista abierta: 0, coste actual: 0
Posición posible: (2 . -1)
Posición posible: (2 . 1)
Posición posible: (3 . 0)
Posición posible: (1 . 0)
Nodo 2, tamaño de la lista abierta: 2, coste actual: 1
Posición posible: (2 . 0)
Posición posible: (2 . 2)
Posición posible: (3 . 1)
Posición posible: (1 . 1)
Nodo 3, tamaño de la lista abierta: 5, coste actual: 1
Posición posible: (3 . -1)
Posición posible: (3 . 1)
Posición posible: (4 . 0)
Posición posible: (2 . 0)
Nodo 4, tamaño de la lista abierta: 6, coste actual: 2
Posición posible: (2 . 1)
Posición posible: (2 . 3)
Posición posible: (3 . 2)
Posición posible: (1 . 2)
Nodo 5, tamaño de la lista abierta: 9, coste actual: 2
Posición posible: (3 . 0)
Posición posible: (3 . 2)
Posición posible: (4 . 1)
Posición posible: (2 . 1)
Nodo 6, tamaño de la lista abierta: 11, coste actual: 3
La ruta entre el punto inicial (r) al punto final (m) en 6 pasos con coste: 3
------
|  m |
|r.. |
| X  |
| X  |
------
(2,0)(2,1)(2,2)(3,2)
Carga del robot: 0
NIL
#+end_src

Como es posible observar, cada problema a su vez es dividido en dos subproblemas donde primero se encuentra una ruta para llegar al inventario (subproblema a) y posteriormente se encuentra otra ruta para llevar dicho inventario a su destino final (subproblema b). En general la solución genera los siguientes resultados:

#+caption: Resultados generales
|----------+---------+-------------------------------------|
| Problema | Coste   | Ruta                                |
|----------+---------+-------------------------------------|
| 1a       |       4 | (2,2)(2,1)(2,0)(1,0)(0,0)           |
| 1b       |       6 | (0,0)(1,0)(2,0)(3,0)(3,1)(3,2)(3,3) |
| 2a       |       2 | (2,2)(2,1)(2,0)                     |
| 2b       |       3 | (2,0)(2,1)(2,2)(3,2)                |
| 3a       |       3 | (2,2)(2,3)(1,3)(0,3)                |
| 3b       |       5 | (0,3)(0,2)(1,2)(2,2)(3,2)(3,1)      |
|----------+---------+-------------------------------------|

Respecto a tomar los problemas como uno solo, se puede decir que el robot siempre debe estar en la posición $(2 . 2)$ para recibir una nueva tarea. De ser así, la única consideración adicional a estos resultados es el orden de solución, el problema 2 debería solucionarse antes que el problema 1, pues el segundo inventario corta el paso al primer inventario.

Si los problemas son totalmente secuenciales, entonces el primer problema a resolver es el número dos. posteriormente no importará porque problema se opte porque el coste total de la solución será 24 para ambos casos posibles.

** Conclusión

En este documento se implementó una solución al problema de la ruta más corta, mismo que ha sido de gran utilidad en la automatización de tareas. Particularmente se ha solicitado emular el comportamiento de un robot que mueve inventarios a través de un mapa cuadricular en el cual se tienen algunas barreras.

Para solucionar esta situación se investigó que el algoritmo A^{*} se considera una mejora al clásico algoritmo de Dijkstra, mejorándolo por medio de una heurística, es decir, estimar cual puede ser el coste total del camino en caso de ser elegido.

Si bien el modelo general de la heurística es sencillo pues consiste tan solo de la suma de funciones, el algoritmo cuenta con un número importante de mejoras y hay numerosos pseudocódigos, algunos más complicados que otros. Tan solo en el material consultado pueden recogerse cuatro pseudocódigos y hasta treinta implementaciones que obedecen a problemas diferentes.

Otro punto negativo esta en cómo implementar las posibles barreras que puede contener un mapa. El pseudocódigo no suele contemplar esos casos. La mayoría de las implementaciones simplemente manejan los mapas como un árbol, de esta manera las barreras simplemente son nodos no conectados. En este documento particular, se asumió que cada nodo agregaba un coste de cero, es decir, lo único que cuesta es el movimiento del robot, y solo los nodos que se identifican como una barrera tendrán un coste adicional de cien. La consecuencia es que cada ruta que contiene un nodo con barrera será muy costosa.

A pesar de lo anteriormente dicho, el algoritmo tiende a ser manejable incluso para seguirlo en papel siempre que el mapa sea pequeño debido a que, diferenciándose de Dijkstra, no tiene que recorrer cada nodo del mapa antes de tomar una decisión final. Gracias al uso de la heurística, el algoritmo reconoce que nodos son más prometedores y los inspecciona, omitiendo aquellos nodos menos probables. Además, ofrece la ventaja de estar incluido en muchas bibliotecas escritas en muchos lenguajes de programación.

Un trabajo prometedor sería mejorar el programa para que detectara barreras de forma dinámica, es decir, localizar en tiempo real inventarios u otros robots que estorben al movimiento.

** Referencias
#+print_bibliography:

* Notas al Pie

[fn:1] Adjunto a este documento se encuentra el archivo \texttt{a-star.out}, un documento de texto plano que tiene la bitácora de ejecución completa de la consola de Common Lisp.

